
===========================================================================
report_checks -unconstrained
===========================================================================
======================= nom_ss_100C_1v60 Corner ===================================

No paths found.


===========================================================================
report_checks --slack_max -0.01
============================================================================
======================= nom_ss_100C_1v60 Corner ===================================

No paths found.


===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================
======================= nom_ss_100C_1v60 Corner ===================================



===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 2 unannotated drivers.
 clk
 rst
Found 0 partially unannotated drivers.

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================

===========================================================================
check_setup -verbose -unconstrained_endpoints -multiple_clock -no_clock -no_input_delay -loops -generated_clocks
===========================================================================
